apache/nuttx/arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/analog/opamp.h>
#include <nuttx/analog/ioctl.h>

#include "chip.h"
#include "stm32_gpio.h"
#include "stm32_opamp_m3m4_v1.h"
#include "stm32_gpio.h"
#include "stm32_opamp_m3m4_v1.h"

/* OPAMP "upper half" support must be enabled */

#ifdef CONFIG_STM32_OPAMP

/* Some OPAMP peripheral must be enabled */

/* Up to 4 OPAMPs in STM32F3 Series */

#if defined(CONFIG_STM32_OPAMP1) || defined(CONFIG_STM32_OPAMP2) || \
    defined(CONFIG_STM32_OPAMP3) || defined(CONFIG_STM32_OPAMP4)

#ifndef CONFIG_STM32_SYSCFG
#  error "SYSCFG clock enable must be set"
#endif

/* @TODO: support for STM32F30XX opamps */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX)

/* Currently only STM32F33XX supported */

#if defined(CONFIG_STM32_STM32F30XX)
#  error "Not supported yet"
#endif

#if defined(CONFIG_STM32_STM32F33XX)
#  if defined(CONFIG_STM32_OPAMP1) || defined(CONFIG_STM32_OPAMP3) ||     \
      defined(CONFIG_STM32_OPAMP4)
#    error "STM32F33 supports only OPAMP2"
#  endif
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* OPAMPs default configuration *********************************************/

#ifdef CONFIG_STM32_OPAMP1
#  ifndef OPAMP1_MODE
#    define OPAMP1_MODE OPAMP_MODE_DEFAULT
#  endif
#  ifndef OPAMP1_MUX
#    define OPAMP1_MUX OPAMP_MUX_DEFAULT
#  endif
#  ifndef OPAMP1_USERCAL
#    define OPAMP1_USERCAL OPAMP_USERCAL_DEFAULT
#  endif
#  ifndef OPAMP1_LOCK
#    define OPAMP1_LOCK OPAMP_LOCK_DEFAULT
#  endif
#  ifndef OPAMP1_GAIN
#    define OPAMP1_GAIN OPAMP_GAIN_DEFAULT
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP2
#  ifndef OPAMP2_MODE
#    define OPAMP2_MODE OPAMP_MODE_DEFAULT
#  endif
#  ifndef OPAMP2_MUX
#    define OPAMP2_MUX OPAMP_MUX_DEFAULT
#  endif
#  ifndef OPAMP2_USERCAL
#    define OPAMP2_USERCAL OPAMP_USERCAL_DEFAULT
#  endif
#  ifndef OPAMP2_LOCK
#    define OPAMP2_LOCK OPAMP_LOCK_DEFAULT
#  endif
#  ifndef OPAMP2_GAIN
#    define OPAMP2_GAIN OPAMP_GAIN_DEFAULT
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP3
#  ifndef OPAMP3_MODE
#    define OPAMP3_MODE OPAMP_MODE_DEFAULT
#  endif
#  ifndef OPAMP3_MUX
#    define OPAMP3_MUX OPAMP_MUX_DEFAULT
#  endif
#  ifndef OPAMP3_USERCAL
#    define OPAMP3_USERCAL OPAMP_USERCAL_DEFAULT
#  endif
#  ifndef OPAMP3_LOCK
#    define OPAMP3_LOCK OPAMP_LOCK_DEFAULT
#  endif
#  ifndef OPAMP3_GAIN
#    define OPAMP3_GAIN OPAMP_GAIN_DEFAULT
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP4
#  ifndef OPAMP4_MODE
#    define OPAMP4_MODE OPAMP_MODE_DEFAULT
#  endif
#  ifndef OPAMP4_MUX
#    define OPAMP4_MUX OPAMP_MUX_DEFAULT
#  endif
#  ifndef OPAMP4_USERCAL
#    define OPAMP4_USERCAL OPAMP_USERCAL_DEFAULT
#  endif
#  ifndef OPAMP4_LOCK
#    define OPAMP4_LOCK OPAMP_LOCK_DEFAULT
#  endif
#  ifndef OPAMP4_GAIN
#    define OPAMP4_GAIN OPAMP_GAIN_DEFAULT
#  endif
#endif

/* Some assertions  *********************************************************/

/* Check OPAMPs inputs selection  */

#ifdef CONFIG_STM32_OPAMP1
#  if (OPAMP1_MODE == OPAMP_MODE_FOLLOWER)
#    define OPAMP1_VMSEL OPAMP1_VMSEL_FOLLOWER
#  endif
#  if (OPAMP1_MODE == OPAMP_MODE_PGA)
#    define OPAMP1_VMSEL OPAMP1_VMSEL_PGA
#  endif
#  if (OPAMP1_MODE == OPAMP_MODE_STANDALONE)
#    ifndef OPAMP1_VMSEL
#      error "OPAMP1_VMSEL must be selected in standalone mode!"
#    endif
#  endif
#  ifndef OPAMP1_VPSEL
#    error "OPAMP1_VPSEL must be selected in standalone mode!"
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP2
#  if (OPAMP2_MODE == OPAMP_MODE_FOLLOWER)
#    define OPAMP2_VMSEL OPAMP2_VMSEL_FOLLOWER
#  endif
#  if (OPAMP2_MODE == OPAMP_MODE_PGA)
#    define OPAMP2_VMSEL OPAMP2_VMSEL_PGA
#  endif
#  if (OPAMP2_MODE == OPAMP_MODE_STANDALONE)
#    ifndef OPAMP2_VMSEL
#      error "OPAMP2_VMSEL must be selected in standalone mode!"
#    endif
#  endif
#  ifndef OPAMP2_VPSEL
#    error "OPAMP2_VPSEL must be selected in standalone mode!"
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP3
#  if (OPAMP3_MODE == OPAMP_MODE_FOLLOWER)
#    define OPAMP3_VMSEL OPAMP3_VMSEL_FOLLOWER
#  endif
#  if (OPAMP3_MODE == OPAMP_MODE_PGA)
#    define OPAMP3_VMSEL OPAMP3_VMSEL_PGA
#  endif
#  if (OPAMP3_MODE == OPAMP_MODE_STANDALONE)
#    ifndef OPAMP3_VMSEL
#      error "OPAMP3_VMSEL must be selected in standalone mode!"
#    endif
#  endif
#  ifndef OPAMP3_VPSEL
#    error "OPAMP3_VPSEL must be selected in standalone mode!"
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP4
#  if (OPAMP4_MODE == OPAMP_MODE_FOLLOWER)
#    define OPAMP4_VMSEL OPAMP4_VMSEL_FOLLOWER
#  endif
#  if (OPAMP4_MODE == OPAMP_MODE_PGA)
#    define OPAMP4_VMSEL OPAMP4_VMSEL_PGA
#  endif
#  if (OPAMP4_MODE == OPAMP_MODE_STANDALONE)
#    ifndef OPAMP4_VMSEL
#      error "OPAMP4_VMSEL must be selected in standalone mode!"
#    endif
#  endif
#  ifndef OPAMP4_VPSEL
#    error "OPAMP4_VPSEL must be selected in standalone mode!"
#  endif
#endif

