apache/nuttx/arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
/* When OPAMP MUX enabled, make sure that secondary selection inputs are
 * configured
 */

#ifdef CONFIG_STM32_OPAMP1
#  if (OPAMP1_MUX == OPAMP_MUX_ENABLE)
#    if !defined(OPAMP1_VMSSEL) || !defined(OPAMP1_VPSSEL)
#      error "OPAMP1_VMSSEL and OPAMP1_VPSSEL must be selected when OPAMP1 MUX enabled!"
#    endif
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP2
#  if (OPAMP2_MUX == OPAMP_MUX_ENABLE)
#    if !defined(OPAMP2_VMSSEL) || !defined(OPAMP2_VPSSEL)
#      error "OPAMP2_VMSSEL and OPAMP2_VPSSEL must be selected when OPAMP2 MUX enabled!"
#    endif
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP3
#  if (OPAMP3_MUX == OPAMP_MUX_ENABLE)
#    if !defined(OPAMP3_VMSSEL) || !defined(OPAMP3_VPSSEL)
#      error "OPAMP3_VMSSEL and OPAMP3_VPSSEL must be selected when OPAMP3 MUX enabled!"
#    endif
#  endif
#endif
#ifdef CONFIG_STM32_OPAMP4
#  if (OPAMP4_MUX == OPAMP_MUX_ENABLE)
#    if !defined(OPAMP4_VMSSEL) || !defined(OPAMP4_VPSSEL)
#      error "OPAMP4_VMSSEL and OPAMP4_VPSSEL must be selected when OPAMP4 MUX enabled!"
#    endif
#  endif
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the configuration of one OPAMP device */

struct stm32_opamp_s
{
  uint32_t csr;                 /* Control and status register */

  uint8_t lock:1;               /* OPAMP lock */
  uint8_t mux:1;                /* Timer controlled MUX mode */
  uint8_t mode:2;               /* OPAMP mode */
  uint8_t gain:4;               /* OPAMP gain in PGA mode */

  uint8_t vm_sel:2;             /* Inverting input selection */
  uint8_t vp_sel:2;             /* Non inverting input selection */
  uint8_t vms_sel:2;            /* Inverting input secondary selection (MUX mode) */
  uint8_t vps_sel:2;            /* Non inverting input secondary selection (Mux mode) */

  uint16_t trim_n:5;            /* Offset trimming value (NMOS) */
  uint16_t trim_p:5;            /* Offset trimming value (PMOS) */
  uint16_t _reserved:6;         /* reserved for calibration */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* OPAMP Register access */

static inline void opamp_modify_csr(struct stm32_opamp_s *priv,
                                    uint32_t clearbits, uint32_t setbits);
static inline uint32_t opamp_getreg_csr(struct stm32_opamp_s *priv);
static inline void opamp_putreg_csr(struct stm32_opamp_s *priv,
                                    uint32_t value);
static bool stm32_opamplock_get(struct stm32_opamp_s *priv);
static int stm32_opamplock(struct stm32_opamp_s *priv, bool lock);

/* Initialization */

static int stm32_opampconfig(struct stm32_opamp_s *priv);
static int stm32_opampenable(struct stm32_opamp_s *priv, bool enable);
static int stm32_opampgain_set(struct stm32_opamp_s *priv, uint8_t gain);
#if 0
static int stm32_opampcalibrate(struct stm32_opamp_s *priv);
#endif

/* OPAMP Driver Methods */

static void opamp_shutdown(struct opamp_dev_s *dev);
static int opamp_setup(struct opamp_dev_s *dev);
static int opamp_ioctl(struct opamp_dev_s *dev, int cmd,
                       unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct opamp_ops_s g_opampops =
{
  .ao_shutdown  = opamp_shutdown,
  .ao_setup     = opamp_setup,
  .ao_ioctl     = opamp_ioctl
};

#ifdef CONFIG_STM32_OPAMP1
static struct stm32_opamp_s g_opamp1priv =
{
  .csr = STM32_OPAMP1_CSR,
  .lock = OPAMP1_LOCK,
  .mux = OPAMP1_MUX,
  .mode = OPAMP1_MODE,
  .vm_sel = OPAMP1_VMSEL,
  .vp_sel = OPAMP1_VPSEL,
#if OPAMP1_MUX == OPAMP_MUX_ENABLE
  .vms_sel = OPAMP1_VMSSEL,
  .vps_sel = OPAMP1_VPSSEL,
#endif
  .gain = OPAMP1_GAIN
};

static struct opamp_dev_s g_opamp1dev =
{
  .ad_ops = &g_opampops,
  .ad_priv = &g_opamp1priv
};
#endif

#ifdef CONFIG_STM32_OPAMP2
static struct stm32_opamp_s g_opamp2priv =
{
  .csr = STM32_OPAMP2_CSR,
  .lock = OPAMP2_LOCK,
  .mux = OPAMP2_MUX,
  .mode = OPAMP2_MODE,
  .vm_sel = OPAMP2_VMSEL,
  .vp_sel = OPAMP2_VPSEL,
#if OPAMP2_MUX == OPAMP_MUX_ENABLE
  .vms_sel = OPAMP2_VMSSEL,
  .vps_sel = OPAMP2_VPSSEL,
#endif
  .gain = OPAMP2_GAIN
};

static struct opamp_dev_s g_opamp2dev =
  {
    .ad_ops = &g_opampops,
    .ad_priv = &g_opamp2priv
  };
#endif

#ifdef CONFIG_STM32_OPAMP3
static struct stm32_opamp_s g_opamp3priv =
{
  .csr = STM32_OPAMP3_CSR,
  .lock = OPAMP3_LOCK,
  .mux = OPAMP3_MUX,
  .mode = OPAMP3_MODE,
  .vm_sel = OPAMP3_VMSEL,
  .vp_sel = OPAMP3_VPSEL,
#if OPAMP3_MUX == OPAMP_MUX_ENABLE
  .vms_sel = OPAMP3_VMSSEL,
  .vps_sel = OPAMP3_VPSSEL,
#endif
  .gain = OPAMP3_GAIN
};

static struct opamp_dev_s g_opamp3dev =
{
  .ad_ops = &g_opampops,
  .ad_priv = &g_opamp3priv
};
#endif

#ifdef CONFIG_STM32_OPAMP4
static struct stm32_opamp_s g_opamp4priv =
{
  .csr = STM32_OPAMP4_CSR,
  .lock = OPAMP4_LOCK,
  .mux = OPAMP4_MUX,
  .mode = OPAMP4_MODE,
  .vm_sel = OPAMP4_VMSEL,
  .vp_sel = OPAMP4_VPSEL,
#if OPAMP4_MUX == OPAMP_MUX_ENABLE
  .vms_sel = OPAMP4_VMSSEL,
  .vps_sel = OPAMP4_VPSSEL,
#endif
  .gain = OPAMP4_GAIN
};

static struct opamp_dev_s g_opamp4dev =
{
  .ad_ops = &g_opampops,
  .ad_priv = &g_opamp4priv
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: opamp_modify_csr
 *
 * Description:
 *   Modify the value of a 32-bit OPAMP CSR register (not atomic).
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

