apache/nuttx/arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
static inline void opamp_modify_csr(struct stm32_opamp_s *priv,
                                    uint32_t clearbits, uint32_t setbits)
{
  uint32_t csr = priv->csr;

  modifyreg32(csr, clearbits, setbits);
}

/****************************************************************************
 * Name: opamp_getreg_csr
 *
 * Description:
 *   Read the value of an OPAMP CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *
 * Returned Value:
 *   The current contents of the OPAMP CSR register
 *
 ****************************************************************************/

static inline uint32_t opamp_getreg_csr(struct stm32_opamp_s *priv)
{
  uint32_t csr = priv->csr;

  return getreg32(csr);
}

/****************************************************************************
 * Name: opamp_putreg_csr
 *
 * Description:
 *   Write a value to an OPAMP register.
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *   value  - The value to write to the OPAMP CSR register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void opamp_putreg_csr(struct stm32_opamp_s *priv,
                                    uint32_t value)
{
  uint32_t csr = priv->csr;

  putreg32(value, csr);
}

/****************************************************************************
 * Name: stm32_opamp_opamplock_get
 *
 * Description:
 *   Get OPAMP lock bit state
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *
 * Returned Value:
 *   True if OPAMP locked, false if not locked
 *
 ****************************************************************************/

static bool stm32_opamplock_get(struct stm32_opamp_s *priv)
{
  uint32_t regval;

  regval = opamp_getreg_csr(priv);

  return (((regval & OPAMP_CSR_LOCK) == 0) ? false : true);
}

/****************************************************************************
 * Name: stm32_opamplock
 *
 * Description:
 *   Lock OPAMP CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *   enable - lock flag
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int stm32_opamplock(struct stm32_opamp_s *priv, bool lock)
{
  bool current;

  current = stm32_opamplock_get(priv);

  if (current)
    {
      if (lock == false)
        {
          aerr("ERROR: OPAMP LOCK can be cleared only by a system reset\n");

          return -EPERM;
        }
    }
  else
    {
      if (lock == true)
        {
          opamp_modify_csr(priv, 0, OPAMP_CSR_LOCK);

          priv->lock = OPAMP_LOCK_RO;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_opampconfig
 *
 * Description:
 *   Configure OPAMP and used I/Os
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int stm32_opampconfig(struct stm32_opamp_s *priv)
{
  uint32_t regval = 0;
  int index;

  /* Get OPAMP index */

  switch (priv->csr)
    {
#ifdef CONFIG_STM32_OPAMP1
    case STM32_OPAMP1_CSR:
      index = 1;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP2
    case STM32_OPAMP2_CSR:
      index = 2;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP3
    case STM32_OPAMP3_CSR:
      index = 3;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP4
    case STM32_OPAMP4_CSR:
      index = 4;
      break;
#endif

    default:
      return -EINVAL;
    }

  /* Configure non inverting input */

  switch (index)
    {
#ifdef CONFIG_STM32_OPAMP1
    case 1:
      {
        switch (priv->vp_sel)
          {
          case OPAMP1_VPSEL_PA7:
            stm32_configgpio(GPIO_OPAMP1_VINP_1);
            regval |= OPAMP_CSR_VPSEL_PA7;
            break;

          case OPAMP1_VPSEL_PA5:
            stm32_configgpio(GPIO_OPAMP1_VINP_2);
            regval |= OPAMP_CSR_VPSEL_PA5;
            break;

          case OPAMP1_VPSEL_PA3:
            stm32_configgpio(GPIO_OPAMP1_VINP_3);
            regval |= OPAMP_CSR_VPSEL_PA3;
            break;

          case OPAMP1_VPSEL_PA1:
            stm32_configgpio(GPIO_OPAMP1_VINP_4);
            regval |= OPAMP_CSR_VPSEL_PA1;
            break;

          default:
            return -EINVAL;
          }
        break;
      }
#endif

#ifdef CONFIG_STM32_OPAMP2
    case 2:
      {
        switch (priv->vp_sel)
          {
#ifndef CONFIG_STM32_STM32F33XX
          case OPAMP2_VPSEL_PD14:
            stm32_configgpio(GPIO_OPAMP2_VINP_1);
            regval |= OPAMP_CSR_VPSEL_PD14;
            break;
#endif
          case OPAMP2_VPSEL_PB14:
            stm32_configgpio(GPIO_OPAMP2_VINP_2);
            regval |= OPAMP_CSR_VPSEL_PB14;
            break;

          case OPAMP2_VPSEL_PB0:
            stm32_configgpio(GPIO_OPAMP2_VINP_3);
            regval |= OPAMP_CSR_VPSEL_PB0;
            break;

          case OPAMP2_VPSEL_PA7:
            stm32_configgpio(GPIO_OPAMP2_VINP_4);
            regval |= OPAMP_CSR_VPSEL_PA7;
            break;

          default:
            return -EINVAL;
          }
        break;
      }
#endif

#ifdef CONFIG_STM32_OPAMP3
    case 3:
      {
        switch (priv->vp_sel)
          {
          case OPAMP3_VPSEL_PB13:
            stm32_configgpio(GPIO_OPAMP3_VINP_1);
            regval |= OPAMP_CSR_VPSEL_PB13;
            break;

          case OPAMP3_VPSEL_PA5:
            stm32_configgpio(GPIO_OPAMP3_VINP_2);
            regval |= OPAMP_CSR_VPSEL_PA5;
            break;

          case OPAMP3_VPSEL_PA1:
            stm32_configgpio(GPIO_OPAMP3_VINP_3);
            regval |= OPAMP_CSR_VPSEL_PA1;
            break;

          case OPAMP3_VPSEL_PB0:
            stm32_configgpio(GPIO_OPAMP3_VINP_4);
            regval |= OPAMP_CSR_VPSEL_PB0;
            break;

          default:
            return -EINVAL;
          }
        break;
      }
#endif

#ifdef CONFIG_STM32_OPAMP4
    case 4:
      {
        switch (priv->vp_sel)
          {
          case OPAMP4_VPSEL_PD11:
            stm32_configgpio(GPIO_OPAMP4_VINP_1);
            regval |= OPAMP_CSR_VPSEL_PD11;
            break;

          case OPAMP4_VPSEL_PB11:
            stm32_configgpio(GPIO_OPAMP4_VINP_2);
            regval |= OPAMP_CSR_VPSEL_PB11;
            break;

          case OPAMP4_VPSEL_PA4:
            stm32_configgpio(GPIO_OPAMP4_VINP_3);
            regval |= OPAMP_CSR_VPSEL_PA4;
            break;

          case OPAMP4_VPSEL_PB13:
            stm32_configgpio(GPIO_OPAMP4_VINP_4;
            regval |= OPAMP_CSR_VPSEL_PB13;
            break;

          default:
            return -EINVAL;
          }
        break;
      }
#endif

    default:
      return -EINVAL;
    }

