apache/nuttx/arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
            /* Configure inverting secondary input */

            switch (index)
              {
#ifdef CONFIG_STM32_OPAMP1
              case 1:
                {
                  switch (priv->vms_sel)
                    {
                    case OPAMP1_VSEL_PC5:
                      stm32_configgpio(GPIO_OPAMP1_VINM_1);
                      regval &= ~OPAMP_CSR_VMSSEL;
                      break;

                    case OPAMP1_VMSEL_PA3:
                      stm32_configgpio(GPIO_OPAMP1_VINM_2);
                      regval |= OPAMP_CSR_VMSSEL;
                      break;

                    default:
                      return -EINVAL;
                    }
                  break;
                }
#endif

#ifdef CONFIG_STM32_OPAMP2
              case 2:
                {
                  switch (priv->vms_sel)
                    {
                    case OPAMP2_VMSEL_PC5:
                      stm32_configgpio(GPIO_OPAMP2_VINM_1);
                      regval &= ~OPAMP_CSR_VMSSEL;
                      break;

                    case OPAMP2_VMSEL_PA5:
                      stm32_configgpio(GPIO_OPAMP2_VINM_2);
                      regval |= OPAMP_CSR_VMSSEL;
                      break;

                    default:
                      return -EINVAL;
                    }
                  break;
                }
#endif

#ifdef CONFIG_STM32_OPAMP3
              case 3:
                {
                  switch (priv->vms_sel)
                    {
                    case OPAMP3_VMSEL_PB10:
                      stm32_configgpio(GPIO_OPAMP3_VINM_1);
                      regval &= ~OPAMP_CSR_VMSSEL;
                      break;

                    case OPAMP3_VMSEL_PB2:
                      stm32_configgpio(GPIO_OPAMP3_VINM_2);
                      regval |= OPAMP_CSR_VMSSEL;
                      break;

                    default:
                      return -EINVAL;
                    }
                  break;
                }
#endif

#ifdef CONFIG_STM32_OPAMP4
              case 4:
                {
                  switch (priv->vms_sel)
                    {
                    case OPAMP4_VMSEL_PB10:
                      stm32_configgpio(GPIO_OPAMP4_VINM_1);
                      regval &= ~OPAMP_CSR_VMSSEL;
                      break;

                    case OPAMP4_VMSEL_PD8:
                      stm32_configgpio(GPIO_OPAMP4_VINM_2);
                      regval |= OPAMP_CSR_VMSSEL;
                      break;

                    default:
                      return -EINVAL;
                    }
                  break;
                }
#endif

              default:
                return -EINVAL;
              }
          }

    /* Save CSR register */

    opamp_putreg_csr(priv, regval);

    /* Configure default gain in PGA mode */

    stm32_opampgain_set(priv, priv->gain);

    /* Enable OPAMP */

    stm32_opampenable(priv, true);

    /* TODO: OPAMP user calibration */

    /* stm32_opampcalibrate(priv); */

    /* Lock OPAMP if needed */

    if (priv->lock == OPAMP_LOCK_RO)
      {
        stm32_opamplock(priv, true);
      }

    return OK;
}

/****************************************************************************
 * Name: stm32_opampenable
 *
 * Description:
 *   Enable/disable OPAMP
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *   enable - enable/disable flag
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int stm32_opampenable(struct stm32_opamp_s *priv, bool enable)
{
  bool lock;

  ainfo("enable: %d\n", enable ? 1 : 0);

  lock = stm32_opamplock_get(priv);

  if (lock)
    {
      aerr("ERROR: OPAMP locked!\n");

      return -EPERM;
    }
  else
    {
      if (enable)
        {
          /* Enable the OPAMP */

          opamp_modify_csr(priv, 0, OPAMP_CSR_OPAMPEN);
        }
      else
        {
          /* Disable the OPAMP */

          opamp_modify_csr(priv, OPAMP_CSR_OPAMPEN, 0);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_opampgain_set
 *
 * Description:
 *   Set OPAMP gain
 *
 * Input Parameters:
 *   priv   - A reference to the OPAMP structure
 *   gain   - OPAMP gain
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int stm32_opampgain_set(struct stm32_opamp_s *priv, uint8_t gain)
{
  bool lock;
  uint32_t regval = 0;

  lock = stm32_opamplock_get(priv);

  if (lock)
    {
      aerr("ERROR: OPAMP locked!\n");
      return -EPERM;
    }

  regval = opamp_getreg_csr(priv);

  switch (gain)
    {
    case OPAMP_GAIN_2:
      regval |= OPAMP_CSR_PGAGAIN_2;
      break;
    case OPAMP_GAIN_4:
      regval |= OPAMP_CSR_PGAGAIN_4;
      break;
    case OPAMP_GAIN_8:
      regval |= OPAMP_CSR_PGAGAIN_8;
      break;
    case OPAMP_GAIN_2_VM0:
      regval |= OPAMP_CSR_PGAGAIN_2VM0;
      break;
    case OPAMP_GAIN_4_VM0:
      regval |= OPAMP_CSR_PGAGAIN_4VM0;
      break;
    case OPAMP_GAIN_8_VM0:
      regval |= OPAMP_CSR_PGAGAIN_8VM0;
      break;
    case OPAMP_GAIN_16_VM0:
      regval |= OPAMP_CSR_PGAGAIN_16VM0;
      break;
    case OPAMP_GAIN_2_VM1:
      regval |= OPAMP_CSR_PGAGAIN_2VM1;
      break;
    case OPAMP_GAIN_4_VM1:
      regval |= OPAMP_CSR_PGAGAIN_4VM1;
      break;
    case OPAMP_GAIN_8_VM1:
      regval |= OPAMP_CSR_PGAGAIN_8VM1;
      break;
    case OPAMP_GAIN_16_VM1:
      regval |= OPAMP_CSR_PGAGAIN_16VM1;
      break;
    default:
      aerr("ERROR: Unsupported OPAMP gain\n");
      return -EINVAL;
    }

  /* Update gain in OPAMP device structure */

  priv->gain = gain;

  return OK;
}

#if 0
static int stm32_opampcalibrate(struct stm32_opamp_s *priv)
{
#warning "Missing logic"

  return OK;
}
#endif

/****************************************************************************
 * Name: opamp_shutdown
 *
 * Description:
 *   Disable the OPAMP.  This method is called when the OPAMP device is
 *   closed. This method reverses the operation the setup method.
 *   Works only if OPAMP device is not locked.
 *
 * Input Parameters:
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void opamp_shutdown(struct opamp_dev_s *dev)
{
#warning "Missing logic"
}

/****************************************************************************
 * Name: opamp_setup
 *
 * Description:
 *   Configure the OPAMP. This method is called the first time that the OPAMP
 *   device is opened.  This will occur when the port is first opened.
 *   This setup includes configuring and attaching OPAMP interrupts.
 *   Interrupts are all disabled upon return.
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

