apache/nuttx/arch/arm/src/common/stm32/stm32_opamp_m3m4_v1.c
static int opamp_setup(struct opamp_dev_s *dev)
{
#warning "Missing logic"
  return OK;
}

/****************************************************************************
 * Name: opamp_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method.
 *
 * Input Parameters:
 *   dev - pointer to device structure used by the driver
 *   cmd - command
 *   arg - arguments passed with command
 *
 * Returned Value:
 *
 ****************************************************************************/

static int opamp_ioctl(struct opamp_dev_s *dev, int cmd,
                       unsigned long arg)
{
#warning "Missing logic"
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_opampinitialize
 *
 * Description:
 *   Initialize the OPAMP.
 *
 * Input Parameters:
 *   intf - The OPAMP interface number.
 *
 * Returned Value:
 *   Valid OPAMP device structure reference on success; a NULL on failure.
 *
 * Assumptions:
 *   1. Clock to the OPAMP block has enabled,
 *   2. Board-specific logic has already configured
 *
 ****************************************************************************/

struct opamp_dev_s *stm32_opampinitialize(int intf)
{
  struct opamp_dev_s *dev;
  struct stm32_opamp_s *opamp;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_STM32_OPAMP1
    case 1:
      ainfo("OPAMP1 selected\n");
      dev = &g_opamp1dev;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP2
    case 2:
      ainfo("OPAMP2 selected\n");
      dev = &g_opamp2dev;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP3
    case 3:
      ainfo("OPAMP3 selected\n");
      dev = &g_opamp3dev;
      break;
#endif

#ifdef CONFIG_STM32_OPAMP4
    case 4:
      ainfo("OPAMP4 selected\n");
      dev = &g_opamp4dev;
      break;
#endif

    default:
      aerr("ERROR: No OPAMP interface defined\n");
      return NULL;
    }

  /* Configure selected OPAMP */

  opamp = dev->ad_priv;

  ret = stm32_opampconfig(opamp);
  if (ret < 0)
    {
      aerr("ERROR: Failed to initialize OPAMP%d: %d\n", intf, ret);
      return NULL;
    }

  return dev;
}

#endif /* CONFIG_STM32_STM32F30XX || CONFIG_STM32_STM32F33XX*/

#endif /* CONFIG_STM32_OPAMP1 || CONFIG_STM32_OPAMP2 ||
        * CONFIG_STM32_OPAMP3 || CONFIG_STM32_OPAMP4
        */

#endif /* CONFIG_STM32_OPAMP */
